GetMonitoredLocalElementIds Method
 Provides the local element IDs when the element is monitoring.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public IList<ElementId> GetMonitoredLocalElementIds()
  Visual Basic
Public Function GetMonitoredLocalElementIds As IList(Of ElementId)
  Visual C++
public:
IList<ElementId^>^ GetMonitoredLocalElementIds()
 Return Value
 The IDs of local element IDs being monitored by this element.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →